## Pandas Function

In [1]:
import pandas as pd

csv1 = pd.read_csv("username.csv")
csv1

    Username  Identifier First name Last name  Salary
0    booker12       9012     Rachel    Booker    1234
1      grey07    grey07      Laura       Grey   54678
2  johnson81        4081      Craig   Johnson  782156
3  jenkins46        9346      Mary    Jenkins  487544
4    smith79        5079      Jamie     Smith  123248

In [2]:
# If there is large amt of data it would be hard to know index of each data by scrolling so use 
csv1.index

RangeIndex(start=0, stop=5, step=1)

In [3]:
# If u want to know the name of all columns
csv1.columns

Index(['Username ', 'Identifier', 'First name', 'Last name', 'Salary'], dtype='object')

In [5]:
# It gives matheaticall values 
csv1.describe()

             Salary
count       5.00000
mean   289772.00000
std    334592.80338
min      1234.00000
25%     54678.00000
50%    123248.00000
75%    487544.00000
max    782156.00000

In [7]:
# If u only want starting some data 
csv1.head(2)

  Username  Identifier First name Last name  Salary
0  booker12       9012     Rachel    Booker    1234
1    grey07    grey07      Laura       Grey   54678

In [8]:
# If u only want ending some data 
csv1.tail(2)

    Username  Identifier First name Last name  Salary
3  jenkins46        9346      Mary    Jenkins  487544
4    smith79        5079      Jamie     Smith  123248

In [10]:
# U can also use string slicing technique to get particular row
csv1[:3]

    Username  Identifier First name Last name  Salary
0    booker12       9012     Rachel    Booker    1234
1      grey07    grey07      Laura       Grey   54678
2  johnson81        4081      Craig   Johnson  782156

In [11]:
# I want data from 1 to 3
csv1[1:4]

    Username  Identifier First name Last name  Salary
1      grey07    grey07      Laura       Grey   54678
2  johnson81        4081      Craig   Johnson  782156
3  jenkins46        9346      Mary    Jenkins  487544

In [12]:
# To change the index number into array 
csv1.index.array

<PandasArray>
[0, 1, 2, 3, 4]
Length: 5, dtype: int64

In [13]:
# U can convert all this data into numpy array
csv1.to_numpy()

array([['booker12', '9012', ' Rachel', ' Booker', 1234],
       ['grey07', 'grey07 ', 'Laura ', 'Grey', 54678],
       ['johnson81 ', '4081', ' Craig', ' Johnson', 782156],
       ['jenkins46 ', '9346', 'Mary ', 'Jenkins', 487544],
       ['smith79 ', '5079', 'Jamie', ' Smith', 123248]], dtype=object)

In [15]:
# Second way to convert in numpy array
import numpy as np
v = np.asarray(csv1)
print(v)

[['booker12' '9012' ' Rachel' ' Booker' 1234]
 ['grey07' 'grey07 ' 'Laura ' 'Grey' 54678]
 ['johnson81 ' '4081' ' Craig' ' Johnson' 782156]
 ['jenkins46 ' '9346' 'Mary ' 'Jenkins' 487544]
 ['smith79 ' '5079' 'Jamie' ' Smith' 123248]]

In [3]:
# Here the data is in ascending order od index number to make it descending and axis = 0 means along row
csv1.sort_index(axis = 0, ascending = False)

    Username  Identifier First name Last name  Salary
4    smith79        5079      Jamie     Smith  123248
3  jenkins46        9346      Mary    Jenkins  487544
2  johnson81        4081      Craig   Johnson  782156
1      grey07    grey07      Laura       Grey   54678
0    booker12       9012     Rachel    Booker    1234

In [4]:
csv1.sort_index(axis = 0, ascending = True)

    Username  Identifier First name Last name  Salary
0    booker12       9012     Rachel    Booker    1234
1      grey07    grey07      Laura       Grey   54678
2  johnson81        4081      Craig   Johnson  782156
3  jenkins46        9346      Mary    Jenkins  487544
4    smith79        5079      Jamie     Smith  123248

In [5]:
# If u want to make any changes suppose laura to dheeraj 
csv1.loc[1,"First name"] = "dheeraj"
csv1

    Username  Identifier First name Last name  Salary
0    booker12       9012     Rachel    Booker    1234
1      grey07    grey07     dheeraj      Grey   54678
2  johnson81        4081      Craig   Johnson  782156
3  jenkins46        9346      Mary    Jenkins  487544
4    smith79        5079      Jamie     Smith  123248

In [6]:
# If u want more particular data 
csv1.loc[[2,3],["First name","Last name"]]

  First name Last name
2      Craig   Johnson
3      Mary    Jenkins

In [7]:
# If u only want first and last name 
csv1.loc[:,["First name","Last name"]]

  First name Last name
0     Rachel    Booker
1    dheeraj      Grey
2      Craig   Johnson
3      Mary    Jenkins
4      Jamie     Smith

In [26]:
# If u only want 2 and 3 
csv1.loc[[2,3],:]

    Username  Identifier First name Last name  Salary Username
2  johnson81        4081      Craig   Johnson  782156      NaN
3  jenkins46        9346      Mary    Jenkins  487544      NaN

In [27]:
# If u only want any one data use iloc
csv1.iloc[2,2]

' Craig'

In [8]:
# If u wan to delete any row 
csv1.drop(0, axis = 0)

    Username  Identifier First name Last name  Salary
1      grey07    grey07     dheeraj      Grey   54678
2  johnson81        4081      Craig   Johnson  782156
3  jenkins46        9346      Mary    Jenkins  487544
4    smith79        5079      Jamie     Smith  123248

In [12]:
# Iff u want to drop any column
csv1.drop("Username ", axis = 1)

  Identifier First name Last name  Salary
0       9012     Rachel    Booker    1234
1    grey07     dheeraj      Grey   54678
2       4081      Craig   Johnson  782156
3       9346      Mary    Jenkins  487544
4       5079      Jamie     Smith  123248